In [1]:
import pandas as pd

In [3]:
pd.__version__

'2.2.3'

In [9]:
apples = pd.Series([3, 2, 0, 1], name="apples")
orange = pd.Series([3, 2, 0, 1], name="orange")

#print("Series - Apples:")
print(apples)

print("\nAccess element at index 1:", apples[1])
df = pd.DataFrame({'apples':apples,'orange':orange})

0    3
1    2
2    0
3    1
Name: apples, dtype: int64

Access element at index 1: 2

In [6]:
apples[0]

np.int64(3)

In [10]:
df

   apples  orange
0       3       3
1       2       2
2       0       0
3       1       1

In [11]:
import pandas as pd

# Sample DataFrame
df = pd.DataFrame({
    "name": ["Alice", "Bob", "Charlie"],
    "age": [25, 30, 35],
    "city": ["NY", "LA", "Chicago"]
})

print("DataFrame:")
print(df)

DataFrame:
      name  age     city
0    Alice   25       NY
1      Bob   30       LA
2  Charlie   35  Chicago

In [12]:
# Access examples
print("\nAccess with loc (row index=1, column 'name'):", df.loc[1, "name"])
print("Access with iloc (row position=2, col position=1):", df.iloc[2, 1])

print("\nAge column:")
df["age"]

print("\nRows 1 to 2 (slice):")
df[1:3]

Access with loc (row index=1, column 'name'): Bob
Access with iloc (row position=2, col position=1): 35

Age column:

Rows 1 to 2 (slice):

      name  age     city
1      Bob   30       LA
2  Charlie   35  Chicago

In [13]:
# Add 5 to each age
df["age_plus_5"] = df["age"] + 5

# Create boolean column (True/False)
df["is_adult"] = df["age"] >= 18

# Apply function: string length of names
df["name_length"] = df["name"].apply(len)

In [19]:
df

      name  age     city  age_plus_5  is_adult  name_length  length
0    Alice   25       NY          30      True            5       5
1      Bob   30       LA          35      True            3       3
2  Charlie   35  Chicago          40      True            7       7

In [18]:
df['length'] = df['name'].apply(lambda x: len(x))